Extensions/ИнтеграцияGreenApi/Catalogs/iga_ТекстыЗапросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>iga_ТекстыЗапросов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Catalogs/iga_ТекстыЗапросов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    
    // Очищаем старые данные
    ТекущийОбъект.Поля.Очистить();
    ТекущийОбъект.Параметры.Очистить();
    
    Если ПустаяСтрока(ТекущийОбъект.ТекстЗапроса) Тогда 
        Возврат; 
    КонецЕсли;
    
    СхемаЗапроса = Новый СхемаЗапроса;
    Попытка
        // Платформа сама проанализирует текст
        СхемаЗапроса.УстановитьТекстЗапроса(ТекущийОбъект.ТекстЗапроса);
    Исключение
        // Если в запросе синтаксическая ошибка, пропускаем разбор
        Возврат;
    КонецПопытки;
    
    // 1. Заполняем параметры
    Для Каждого Пар Из СхемаЗапроса.НайтиПараметры() Цикл
        НоваяСтрока = ТекущийОбъект.Параметры.Добавить();
        НоваяСтрока.ИмяПараметра = Пар.Имя;
    КонецЦикла;
    
    // 2. Заполняем поля (берем колонки из ПОСЛЕДНЕГО пакета запроса)
    // Последний пакет используется на случай, если запрос использует временные таблицы
    ВсегоПакетов = СхемаЗапроса.ПакетЗапросов.Количество();
    Если ВсегоПакетов > 0 Тогда
        ПоследнийПакет = СхемаЗапроса.ПакетЗапросов[ВсегоПакетов - 1];
        Для Каждого Колонка Из ПоследнийПакет.Колонки Цикл
            НоваяСтрока = ТекущийОбъект.Поля.Добавить();
            // Используем Алиас (синоним), так как именно под ним поле будет в Выборке
            НоваяСтрока.ИмяПоля = Колонка.Псевдоним; 
        КонецЦикла;
    КонецЕсли;
    
КонецПроцедуры
